# Дано ціле число. Вивести його рядок-опис виду «від'ємне парне число», «нульове число», «додатне
# непарне число» і т. д.


def num_description(num):
    if num < 0 and num % 2:
        print("від'ємне непарне число")
    elif num == 0:
        print("нульове число")
    elif num > 0 and num % 2:
        print("додатне непарне число")
    elif num > 0:
        print("додатне парне число")
    else:
        print("від'ємне парне число")


x = int(input("Введіть ціле число: "))
num_description(x)
