# Гасимова Аміна Лабораторна робота№2
# 10. Дано ціле число в діапазоні 100-999. Вивести рядок-опис даного числа, наприклад: 256 - "двісті
# п'ятдесят шість", 814 - "вісімсот чотирнадцять».


def num_description(x):
    hundreds = {
        1: "сто",
        2: "двісті",
        3: "триста",
        4: "чотириста",
        5: "п'ятсот",
        6: "шістсот",
        7: "сімсот",
        8: "вісімсот",
        9: "дев'ятсот"
    }
    ten = {
        0: "",
        2: "двадцять",
        3: "тридцять",
        4: "сорок",
        5: "п'ятдесят",
        6: "шістдесят",
        7: "сімдесят",
        8: "вісімдесят",
        9: "дев'яносто",
        10: "десять",
        11: "одинадцять",
        12: "дванадцять",
        13: "тринадцять",
        14: "чотирнадцять",
        15: "п'ятнадцять",
        16: "шістнадцять",
        17: "сімнадцять",
        18: "вісімнадцять",
        19: "дев'ятнадцять"
    }
    units = ["", "один", "два", "три", "чотири", "п'ять", "шість", "сім", "вісім", "дев'ять"]
    if x in range(100, 999):
        hand = x//100
        if ((x % 100) > 9) and ((x % 100) < 20):
            ten_n = x % 100
        elif ((x % 100) > 9) and ((x % 100) > 20):
            ten_n = x % 100 // 10
        else:
            ten_n = 0
        if ((x % 100) > 9) and ((x % 100) < 20):
            un = 0
        else:
            un = x % 100 % 10
        number = hundreds[hand] + " " + ten[ten_n] + " " + units[un]
        print(number)
    else:
        print("Помилка! Введіть ціле число в діапазоні 100-999!")


num = int(input("Введіть ціле число в діапазоні 100-999: "))
num_description(num)
