# 20. Дано ціле число, яке лежить в діапазоні 1-999. Вивести його рядок-опис виду «парне двозначне
# число», «непарне тризначне число» і т. Д


def des_num(x):
    if x in range(1, 999):
        if x < 10:
            if x % 2:
                print("непарне однозначне число")
            else:
                print("парне однозначне число")
        elif 9 < x < 100:
            if x % 2:
                print("непарне двозначне число")
            else:
                print("парне двозначне число")
        else:
            if x % 2:
                print("непарне тризначне число")
            else:
                print("парне тризначне число")
    else:
        print("Ви вели некорекне число!")
        print("Введіть ціле число в діапазоні 1-999!")


num = int(input("Введіть ціле число в діапазоні 1-999: "))
des_num(num)
